TWO_fimi_client/Debug/POSRequestP2PDiasRq.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:fimi="http://schemas.compassplus.com/two/1.0/fimi.xsd" xmlns:fimi1="http://schemas.compassplus.com/two/1.0/fimi_types.xsd">
   <soap:Header/>
  <soap:Body>
    <fimi:POSRequestRq>
      <fimi:Request>
        <!--You may enter the following 115 items in any order-->
        <!--Optional:-->
        <fimi1:TranType>200</fimi1:TranType>
        <fimi1:TranCode>135</fimi1:TranCode>
        <fimi1:CardUID>420000031125</fimi1:CardUID>
        <fimi1:CardUID2>420000028732</fimi1:CardUID2>
        <fimi1:TranNumber>420009599766</fimi1:TranNumber>
        <fimi1:FromAcctType>1</fimi1:FromAcctType>
        <!--?-->
        <fimi1:Amount>233</fimi1:Amount>
        <fimi1:Currency>810</fimi1:Currency>
        <fimi1:Condition>0</fimi1:Condition>
        <fimi1:EntryMode>12</fimi1:EntryMode>
        <!--<fimi1:P2PSourceOfFunds>5</fimi1:P2PSourceOfFunds>-->
        <!--<fimi1:TranNumber>99074153</fimi1:TranNumber>
-->
        <!--<fimi1:DraftCapture>?</fimi1:DraftCapture>
-->
      </fimi:Request>
    </fimi:POSRequestRq>
  </soap:Body>
</soap:Envelope>